app/Http/Controllers/CartController.php

select count(*) as aggregate from `orders`
select * from `orders` order by `created_at` desc limit 1
---
     public function generateInvoice(){
        //mengambil data dari table orders
        $order = Order::orderBy('created_at', 'DESC');

        //jika sudah terdapat records
        if ($order->count() > 0) {
            //mengambil data pertama yang sdh dishort DESC
            $order = $order->first();

select * from `orders` order by `created_at` desc limit 1
select * from `products` where `id` = '2' limit 1
update `products` set `stock` = 42, `updated_at` = '2019-08-21 16:19:05' where `id` = 2
---
    public function storeCheckout(Request $request){
        $client = new Client();
        $result = Cart::content();
       $total = str_replace(',', '', $request->total);
       DB::beginTransaction();
       try{
           $order = Order::create([
               'invoice' => $this->generateInvoice(),

               'user_id' => $request->user_id,
               'total' => $total,
           ]);
           $ambil = Order::orderBy('created_at', 'DESC');
               //mengambil data pertama yang sdh dishort DESC
               $pertama = $ambil->first();
               $order_id = $pertama->id;

           foreach($result as $key => $r){
               Order_detail::create([
               // $order->order_detail()->create([
                   'order_id' =>  $order_id,
                   'product_id' => $r->id,
                   'qty' =>  $r->qty,
                   'price' => $r->subtotal,
               ]);
           }

           $item = Product::where('id', '=', $r->id)->first();
           $item->stock = (int)$item->stock - (int)$r->qty;
           $item->save();