app/Http/Controllers/ListController.php

select * from `products`
---
    public function index()
    {
        $products = Product::all();

select * from `products` where `id` = '2' limit 1
---
    public function show($id)
    {
        $product = Product::where('id', $id)->firstOrFail();