app/Http/Controllers/OrderController.php

    public function invoicePdf($invoice){
        $order = Order::where('invoice', $invoice)
            ->with('customer', 'order_detail', 'order_detail.product')->first();
---
select * from `orders` where `invoice` = 'INV-4' limit 1