app/Http/Controllers/ShippingController.php

    public function generatePayment()
    {
        //mengambil data dari table orders
        $pay = Payment::orderBy('created_at', 'DESC');

        //jika sudah terdapat records
        if ($pay->count() > 0) {
            //mengambil data pertama yang sdh dishort DESC
            $f = $pay->first();
---
select count(*) as aggregate from `payments`
select * from `payments` order by `created_at` desc limit 1

    public function payment(){
        $ambil = Order::orderBy('created_at', 'DESC');
        //mengambil data pertama yang sdh dishort DESC
        $order = $ambil->first();

       $ongkir = Ongkir::orderBy('created_at', 'ASC')->get();
---
select * from `orders` order by `created_at` desc limit 1
select * from `ongkirs` order by `created_at` asc



            $pay = Payment::orderBy('created_at', 'DESC');
            $pertama = $pay->first();
---
select * from `payments` order by `created_at` desc limit 1

     public function confpay(){
        $pay = Payment::orderBy('created_at', 'DESC');
        $p = $pay->first();
---
select * from `payments` order by `created_at` desc limit 1

     public function formPayment($id){
       $payment = Payment::findOrfail($id);
---
select * from `payments` where `payments`.`id` = 'PAY-2' limit 1

     public function updatePayment(Request $request, $id){

        try{
            $payment = Payment::findOrfail($id);
---
select * from `payments` where `payments`.`id` = 'PAY-2' limit 1